source/app/controllers/colors_controller.rb

  def index
    @colors = Color.all
---
SELECT "colors".* FROM "colors"

  def show # ONE COLOR
    @stories = Story.where(color_id: params[:id])
    @color = @stories.first.color
---
SELECT  "stories".* FROM "stories"  WHERE "stories"."color_id" = 3  ORDER BY "stories"."id" ASC LIMIT 1
SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 3]]