source/app/controllers/stories_controller.rb

INSERT INTO "stories" ("anecdote", "color_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["anecdote", "abc"], ["color_id", 2], ["created_at", "2014-06-28 17:20:26.094080"], ["updated_at", "2014-06-28 17:20:26.094080"]]
---
  def create
    @story = Story.new( anecdote: params[:anecdote],
                        color_id: params[:color_id] )
    if @story.save

SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @color = Color.find(params[:color_id])

SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 3]]
---
  def load_color
    @color = Color.find params[:color_id]