app/views/colors/show.html.erb

SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 2]]
---
<h1> <%= link_to "That #{@stories.first.color.name.capitalize} Feely", stories_all_path %> </h1>