app/controllers/colors_controller.rb

  def index
    @colors = Color.all
---
SELECT "colors".* FROM "colors"

  def show
    @color = Color.find params[:id]
    @stories = Story.where(color_id: @color.id)
---
SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "stories".* FROM "stories"  WHERE "stories"."color_id" = 2  ORDER BY "stories"."id" ASC LIMIT 1