app/controllers/stories_controller.rb

INSERT INTO "stories" ("anecdote", "color_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["anecdote", "great"], ["color_id", 5], ["created_at", "2014-06-29 20:12:43.215487"], ["updated_at", "2014-06-29 20:12:43.215487"]]
---
  def create
    @story = Story.new( anecdote: params[:story][:anecdote],
                        color_id: params[:color_id] )
    if @story.save

SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 5]]
---
  def load_color
    @color = Color.find params[:color_id]