source/app/views/colors/show.html.erb

<div class="container">
  <h1> <%= link_to "That #{@stories.first.color.name.capitalize} Feely", stories_all_path %> </h1>
---
SELECT  "colors".* FROM "colors"  WHERE "colors"."id" = $1 LIMIT 1  [["id", 3]]